lbekit/MicroprocessorProjects/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : SetDefaultRouting
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void SetDefaultRouting(void)
{
    /* Enables the clock for the I/O controller.: Enable Clock. */
    CLOCK_EnableClock(kCLOCK_Iocon);

    const uint32_t port0_pin0_config = (/* Pin is disabled */
                                        IOCON_PIO_FUNC0 |
                                        /* No addition pin function */
                                        IOCON_PIO_MODE_INACT |
                                        /* Standard mode, output slew rate control is enabled */
                                        IOCON_PIO_SLEW_STANDARD |
                                        /* Input function is not inverted */
                                        IOCON_PIO_INV_DI |
                                        /* Enables analog function */
                                        IOCON_PIO_ANALOG_EN |
                                        /* Open drain is disabled */
                                        IOCON_PIO_OPENDRAIN_DI |
                                        /* Analog switch is open (disabled) */
                                        IOCON_PIO_ASW_DI);
    /* PORT00 (pin 54) is disabled */
    IOCON_PinMuxSet(IOCON, 0U, 0U, port0_pin0_config);

    const uint32_t port0_pin1_config = (/* Pin is disabled */
                                        IOCON_PIO_FUNC0 |
                                        /* No addition pin function */
                                        IOCON_PIO_MODE_INACT |
                                        /* Standard mode, output slew rate control is enabled */
                                        IOCON_PIO_SLEW_STANDARD |
                                        /* Input function is not inverted */
                                        IOCON_PIO_INV_DI |
                                        /* Enables analog function */
                                        IOCON_PIO_ANALOG_EN |
                                        /* Open drain is disabled */
                                        IOCON_PIO_OPENDRAIN_DI);
    /* PORT01 (pin 7) is disabled */
    IOCON_PinMuxSet(IOCON, 0U, 1U, port0_pin1_config);

    const uint32_t port0_pin10_config = (/* Pin is disabled */
                                         IOCON_PIO_FUNC0 |
                                         /* No addition pin function */
                                         IOCON_PIO_MODE_INACT |
                                         /* Standard mode, output slew rate control is enabled */
                                         IOCON_PIO_SLEW_STANDARD |
                                         /* Input function is not inverted */
                                         IOCON_PIO_INV_DI |
                                         /* Enables analog function */
                                         IOCON_PIO_ANALOG_EN |
                                         /* Open drain is disabled */
                                         IOCON_PIO_OPENDRAIN_DI |
                                         /* Analog switch is open (disabled) */
                                         IOCON_PIO_ASW_DI);
    /* PORT010 (pin 21) is disabled */
    IOCON_PinMuxSet(IOCON, 0U, 10U, port0_pin10_config);

    if (Chip_GetVersion()==1)
    {
        const uint32_t DEBUG_SWD_SWDCLK = (/* Pin is configured as SWCLK */
                                           IOCON_PIO_FUNC6 |
                                           /* Selects pull-down function */
                                           IOCON_PIO_MODE_PULLDOWN |
                                           /* Standard mode, output slew rate control is enabled */
                                           IOCON_PIO_SLEW_STANDARD |
                                           /* Input function is not inverted */
                                           IOCON_PIO_INV_DI |
                                           /* Enables digital function */
                                           IOCON_PIO_DIGITAL_EN |
                                           /* Open drain is disabled */
                                           IOCON_PIO_OPENDRAIN_DI |
                                           /* Analog switch is open (disabled) */
                                           IOCON_PIO_ASW_DI);
        /* PORT0 PIN11 (coords: 13) is configured as SWCLK */
        IOCON_PinMuxSet(IOCON, SETDEFAULTROUTING_DEBUG_SWD_SWDCLK_PORT, SETDEFAULTROUTING_DEBUG_SWD_SWDCLK_PIN, DEBUG_SWD_SWDCLK);
    }
    else
    {
        const uint32_t DEBUG_SWD_SWDCLK = (/* Pin is configured as SWCLK */
                                           IOCON_PIO_FUNC6 |
                                           /* Selects pull-down function */
                                           IOCON_PIO_MODE_PULLDOWN |
                                           /* Standard mode, output slew rate control is enabled */
                                           IOCON_PIO_SLEW_STANDARD |
                                           /* Input function is not inverted */
                                           IOCON_PIO_INV_DI |
                                           /* Enables digital function */
                                           IOCON_PIO_DIGITAL_EN |
                                           /* Open drain is disabled */
                                           IOCON_PIO_OPENDRAIN_DI |
                                           /* Analog switch is open (disabled), only for A0 version */
                                           IOCON_PIO_ASW_DIS_DI);
        /* PORT0 PIN11 (coords: 13) is configured as SWCLK */
        IOCON_PinMuxSet(IOCON, SETDEFAULTROUTING_DEBUG_SWD_SWDCLK_PORT, SETDEFAULTROUTING_DEBUG_SWD_SWDCLK_PIN, DEBUG_SWD_SWDCLK);
    }

