lbekit/MicroprocessorProjects/board/pin_mux.c
    if (Chip_GetVersion()==1)
    {
        const uint32_t DEBUG_SWD_SWDIO = (/* Pin is configured as SWDIO */
                                          IOCON_PIO_FUNC6 |
                                          /* Selects pull-up function */
                                          IOCON_PIO_MODE_PULLUP |
                                          /* Standard mode, output slew rate control is enabled */
                                          IOCON_PIO_SLEW_STANDARD |
                                          /* Input function is not inverted */
                                          IOCON_PIO_INV_DI |
                                          /* Enables digital function */
                                          IOCON_PIO_DIGITAL_EN |
                                          /* Open drain is disabled */
                                          IOCON_PIO_OPENDRAIN_DI |
                                          /* Analog switch is open (disabled) */
                                          IOCON_PIO_ASW_DI);
        /* PORT0 PIN12 (coords: 12) is configured as SWDIO */
        IOCON_PinMuxSet(IOCON, SETDEFAULTROUTING_DEBUG_SWD_SWDIO_PORT, SETDEFAULTROUTING_DEBUG_SWD_SWDIO_PIN, DEBUG_SWD_SWDIO);
    }
    else
    {
        const uint32_t DEBUG_SWD_SWDIO = (/* Pin is configured as SWDIO */
                                          IOCON_PIO_FUNC6 |
                                          /* Selects pull-up function */
                                          IOCON_PIO_MODE_PULLUP |
                                          /* Standard mode, output slew rate control is enabled */
                                          IOCON_PIO_SLEW_STANDARD |
                                          /* Input function is not inverted */
                                          IOCON_PIO_INV_DI |
                                          /* Enables digital function */
                                          IOCON_PIO_DIGITAL_EN |
                                          /* Open drain is disabled */
                                          IOCON_PIO_OPENDRAIN_DI |
                                          /* Analog switch is open (disabled), only for A0 version */
                                          IOCON_PIO_ASW_DIS_DI);
        /* PORT0 PIN12 (coords: 12) is configured as SWDIO */
        IOCON_PinMuxSet(IOCON, SETDEFAULTROUTING_DEBUG_SWD_SWDIO_PORT, SETDEFAULTROUTING_DEBUG_SWD_SWDIO_PIN, DEBUG_SWD_SWDIO);
    }

    const uint32_t port0_pin13_config = (/* Pin is disabled */
                                         IOCON_PIO_FUNC0 |
                                         /* No addition pin function */
                                         IOCON_PIO_MODE_INACT |
                                         /* Standard mode, output slew rate control is enabled */
                                         IOCON_PIO_SLEW_STANDARD |
                                         /* Input function is not inverted */
                                         IOCON_PIO_INV_DI |
                                         /* Enables analog function */
                                         IOCON_PIO_ANALOG_EN |
                                         /* Open drain is disabled */
                                         IOCON_PIO_OPENDRAIN_DI |
                                         /* 3V3 signaling in I2C mode */
                                         IOCON_PIO_SSEL_3V3 |
                                         /* Input filter disabled */
                                         IOCON_PIO_INPFILT_OFF |
                                         /* IO is an open drain cell */
                                         IOCON_PIO_ECS_DI |
                                         /* GPIO mode */
                                         IOCON_PIO_EGP_GPIO |
                                         /* I2C 50 ns glitch filter enabled. Typically used for Standard mode, Fast-mode and Fast-mode Plus I2C. */
                                         IOCON_PIO_I2CFILTER_NONHIGHSPEED);
    /* PORT013 (pin 71) is disabled */
    IOCON_PinMuxSet(IOCON, 0U, 13U, port0_pin13_config);

    const uint32_t port0_pin14_config = (/* Pin is disabled */
                                         IOCON_PIO_FUNC0 |
                                         /* No addition pin function */
                                         IOCON_PIO_MODE_INACT |
                                         /* Standard mode, output slew rate control is enabled */
                                         IOCON_PIO_SLEW_STANDARD |
                                         /* Input function is not inverted */
                                         IOCON_PIO_INV_DI |
                                         /* Enables analog function */
                                         IOCON_PIO_ANALOG_EN |
                                         /* Open drain is disabled */
                                         IOCON_PIO_OPENDRAIN_DI |
                                         /* 3V3 signaling in I2C mode */
                                         IOCON_PIO_SSEL_3V3 |
                                         /* Input filter disabled */
                                         IOCON_PIO_INPFILT_OFF |
                                         /* IO is an open drain cell */
                                         IOCON_PIO_ECS_DI |
                                         /* GPIO mode */
                                         IOCON_PIO_EGP_GPIO |
                                         /* I2C 50 ns glitch filter enabled. Typically used for Standard mode, Fast-mode and Fast-mode Plus I2C. */
                                         IOCON_PIO_I2CFILTER_NONHIGHSPEED);
    /* PORT014 (pin 72) is disabled */
    IOCON_PinMuxSet(IOCON, 0U, 14U, port0_pin14_config);

    if (Chip_GetVersion()==1)
    {
        const uint32_t port0_pin15_config = (/* Pin is disabled */
                                             IOCON_PIO_FUNC0 |
                                             /* No addition pin function */
                                             IOCON_PIO_MODE_INACT |
                                             /* Standard mode, output slew rate control is enabled */
                                             IOCON_PIO_SLEW_STANDARD |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables analog function */
                                             IOCON_PIO_ANALOG_EN |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI |
                                             /* Analog switch is open (disabled) */
                                             IOCON_PIO_ASW_DI);
        /* PORT015 (pin 22) is disabled */
        IOCON_PinMuxSet(IOCON, 0U, 15U, port0_pin15_config);
    }
    else
    {
        const uint32_t port0_pin15_config = (/* Pin is disabled */
                                             IOCON_PIO_FUNC0 |
                                             /* No addition pin function */
                                             IOCON_PIO_MODE_INACT |
                                             /* Standard mode, output slew rate control is enabled */
                                             IOCON_PIO_SLEW_STANDARD |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables analog function */
                                             IOCON_PIO_ANALOG_EN |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI |
                                             /* Analog switch is open (disabled), only for A0 version */
                                             IOCON_PIO_ASW_DIS_DI);
        /* PORT015 (pin 22) is disabled */
        IOCON_PinMuxSet(IOCON, 0U, 15U, port0_pin15_config);
    }

    const uint32_t port0_pin16_config = (/* Pin is disabled */
                                         IOCON_PIO_FUNC0 |
                                         /* No addition pin function */
                                         IOCON_PIO_MODE_INACT |
                                         /* Standard mode, output slew rate control is enabled */
                                         IOCON_PIO_SLEW_STANDARD |
                                         /* Input function is not inverted */
                                         IOCON_PIO_INV_DI |
                                         /* Enables analog function */
                                         IOCON_PIO_ANALOG_EN |
                                         /* Open drain is disabled */
                                         IOCON_PIO_OPENDRAIN_DI |
                                         /* Analog switch is open (disabled) */
                                         IOCON_PIO_ASW_DI);
    /* PORT016 (pin 14) is disabled */
    IOCON_PinMuxSet(IOCON, 0U, 16U, port0_pin16_config);

    const uint32_t port0_pin17_config = (/* Pin is disabled */
                                         IOCON_PIO_FUNC0 |
                                         /* No addition pin function */
                                         IOCON_PIO_MODE_INACT |
                                         /* Standard mode, output slew rate control is enabled */
                                         IOCON_PIO_SLEW_STANDARD |
                                         /* Input function is not inverted */
                                         IOCON_PIO_INV_DI |
                                         /* Enables analog function */
                                         IOCON_PIO_ANALOG_EN |
                                         /* Open drain is disabled */
                                         IOCON_PIO_OPENDRAIN_DI);
    /* PORT017 (pin 8) is disabled */
    IOCON_PinMuxSet(IOCON, 0U, 17U, port0_pin17_config);

