lbekit/MicroprocessorProjects/board/pin_mux.c
    if (Chip_GetVersion()==1)
    {
        const uint32_t port0_pin18_config = (/* Pin is disabled */
                                             IOCON_PIO_FUNC0 |
                                             /* No addition pin function */
                                             IOCON_PIO_MODE_INACT |
                                             /* Standard mode, output slew rate control is enabled */
                                             IOCON_PIO_SLEW_STANDARD |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables analog function */
                                             IOCON_PIO_ANALOG_EN |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI |
                                             /* Analog switch is open (disabled) */
                                             IOCON_PIO_ASW_DI);
        /* PORT018 (pin 56) is disabled */
        IOCON_PinMuxSet(IOCON, 0U, 18U, port0_pin18_config);
    }
    else
    {
        const uint32_t port0_pin18_config = (/* Pin is disabled */
                                             IOCON_PIO_FUNC0 |
                                             /* No addition pin function */
                                             IOCON_PIO_MODE_INACT |
                                             /* Standard mode, output slew rate control is enabled */
                                             IOCON_PIO_SLEW_STANDARD |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables analog function */
                                             IOCON_PIO_ANALOG_EN |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI |
                                             /* Analog switch is open (disabled), only for A0 version */
                                             IOCON_PIO_ASW_DIS_DI);
        /* PORT018 (pin 56) is disabled */
        IOCON_PinMuxSet(IOCON, 0U, 18U, port0_pin18_config);
    }

    const uint32_t FC7_I2S_WS = (/* Pin is disabled */
                                 IOCON_PIO_FUNC0 |
                                 /* No addition pin function */
                                 IOCON_PIO_MODE_INACT |
                                 /* Standard mode, output slew rate control is enabled */
                                 IOCON_PIO_SLEW_STANDARD |
                                 /* Input function is not inverted */
                                 IOCON_PIO_INV_DI |
                                 /* Enables analog function */
                                 IOCON_PIO_ANALOG_EN |
                                 /* Open drain is disabled */
                                 IOCON_PIO_OPENDRAIN_DI);
    /* PORT019 (pin 90) is disabled */
    IOCON_PinMuxSet(IOCON, SETDEFAULTROUTING_FC7_I2S_WS_PORT, SETDEFAULTROUTING_FC7_I2S_WS_PIN, FC7_I2S_WS);

    const uint32_t FC7_I2S_TX = (/* Pin is disabled */
                                 IOCON_PIO_FUNC0 |
                                 /* No addition pin function */
                                 IOCON_PIO_MODE_INACT |
                                 /* Standard mode, output slew rate control is enabled */
                                 IOCON_PIO_SLEW_STANDARD |
                                 /* Input function is not inverted */
                                 IOCON_PIO_INV_DI |
                                 /* Enables analog function */
                                 IOCON_PIO_ANALOG_EN |
                                 /* Open drain is disabled */
                                 IOCON_PIO_OPENDRAIN_DI);
    /* PORT020 (pin 74) is disabled */
    IOCON_PinMuxSet(IOCON, SETDEFAULTROUTING_FC7_I2S_TX_PORT, SETDEFAULTROUTING_FC7_I2S_TX_PIN, FC7_I2S_TX);

    const uint32_t FC7_I2S_SCK = (/* Pin is disabled */
                                  IOCON_PIO_FUNC0 |
                                  /* No addition pin function */
                                  IOCON_PIO_MODE_INACT |
                                  /* Standard mode, output slew rate control is enabled */
                                  IOCON_PIO_SLEW_STANDARD |
                                  /* Input function is not inverted */
                                  IOCON_PIO_INV_DI |
                                  /* Enables analog function */
                                  IOCON_PIO_ANALOG_EN |
                                  /* Open drain is disabled */
                                  IOCON_PIO_OPENDRAIN_DI);
    /* PORT021 (pin 76) is disabled */
    IOCON_PinMuxSet(IOCON, SETDEFAULTROUTING_FC7_I2S_SCK_PORT, SETDEFAULTROUTING_FC7_I2S_SCK_PIN, FC7_I2S_SCK);

    const uint32_t USB0_VBUS = (/* Pin is disabled */
                                IOCON_PIO_FUNC0 |
                                /* No addition pin function */
                                IOCON_PIO_MODE_INACT |
                                /* Standard mode, output slew rate control is enabled */
                                IOCON_PIO_SLEW_STANDARD |
                                /* Input function is not inverted */
                                IOCON_PIO_INV_DI |
                                /* Enables analog function */
                                IOCON_PIO_ANALOG_EN |
                                /* Open drain is disabled */
                                IOCON_PIO_OPENDRAIN_DI);
    /* PORT022 (pin 78) is disabled */
    IOCON_PinMuxSet(IOCON, SETDEFAULTROUTING_USB0_VBUS_PORT, SETDEFAULTROUTING_USB0_VBUS_PIN, USB0_VBUS);

    const uint32_t port0_pin23_config = (/* Pin is disabled */
                                         IOCON_PIO_FUNC0 |
                                         /* No addition pin function */
                                         IOCON_PIO_MODE_INACT |
                                         /* Standard mode, output slew rate control is enabled */
                                         IOCON_PIO_SLEW_STANDARD |
                                         /* Input function is not inverted */
                                         IOCON_PIO_INV_DI |
                                         /* Enables analog function */
                                         IOCON_PIO_ANALOG_EN |
                                         /* Open drain is disabled */
                                         IOCON_PIO_OPENDRAIN_DI |
                                         /* Analog switch is open (disabled) */
                                         IOCON_PIO_ASW_DI);
    /* PORT023 (pin 20) is disabled */
    IOCON_PinMuxSet(IOCON, 0U, 23U, port0_pin23_config);

    const uint32_t port0_pin24_config = (/* Pin is disabled */
                                         IOCON_PIO_FUNC0 |
                                         /* No addition pin function */
                                         IOCON_PIO_MODE_INACT |
                                         /* Standard mode, output slew rate control is enabled */
                                         IOCON_PIO_SLEW_STANDARD |
                                         /* Input function is not inverted */
                                         IOCON_PIO_INV_DI |
                                         /* Enables analog function */
                                         IOCON_PIO_ANALOG_EN |
                                         /* Open drain is disabled */
                                         IOCON_PIO_OPENDRAIN_DI);
    /* PORT024 (pin 70) is disabled */
    IOCON_PinMuxSet(IOCON, 0U, 24U, port0_pin24_config);

    const uint32_t port0_pin25_config = (/* Pin is disabled */
                                         IOCON_PIO_FUNC0 |
                                         /* No addition pin function */
                                         IOCON_PIO_MODE_INACT |
                                         /* Standard mode, output slew rate control is enabled */
                                         IOCON_PIO_SLEW_STANDARD |
                                         /* Input function is not inverted */
                                         IOCON_PIO_INV_DI |
                                         /* Enables analog function */
                                         IOCON_PIO_ANALOG_EN |
                                         /* Open drain is disabled */
                                         IOCON_PIO_OPENDRAIN_DI);
    /* PORT025 (pin 79) is disabled */
    IOCON_PinMuxSet(IOCON, 0U, 25U, port0_pin25_config);

    const uint32_t port0_pin26_config = (/* Pin is disabled */
                                         IOCON_PIO_FUNC0 |
                                         /* No addition pin function */
                                         IOCON_PIO_MODE_INACT |
                                         /* Standard mode, output slew rate control is enabled */
                                         IOCON_PIO_SLEW_STANDARD |
                                         /* Input function is not inverted */
                                         IOCON_PIO_INV_DI |
                                         /* Enables analog function */
                                         IOCON_PIO_ANALOG_EN |
                                         /* Open drain is disabled */
                                         IOCON_PIO_OPENDRAIN_DI);
    /* PORT026 (pin 60) is disabled */
    IOCON_PinMuxSet(IOCON, 0U, 26U, port0_pin26_config);

