lbekit/MicroprocessorProjects/board/pin_mux.c
    const uint32_t port0_pin27_config = (/* Pin is disabled */
                                         IOCON_PIO_FUNC0 |
                                         /* No addition pin function */
                                         IOCON_PIO_MODE_INACT |
                                         /* Standard mode, output slew rate control is enabled */
                                         IOCON_PIO_SLEW_STANDARD |
                                         /* Input function is not inverted */
                                         IOCON_PIO_INV_DI |
                                         /* Enables analog function */
                                         IOCON_PIO_ANALOG_EN |
                                         /* Open drain is disabled */
                                         IOCON_PIO_OPENDRAIN_DI);
    /* PORT027 (pin 27) is disabled */
    IOCON_PinMuxSet(IOCON, 0U, 27U, port0_pin27_config);

    const uint32_t port0_pin28_config = (/* Pin is disabled */
                                         IOCON_PIO_FUNC0 |
                                         /* No addition pin function */
                                         IOCON_PIO_MODE_INACT |
                                         /* Standard mode, output slew rate control is enabled */
                                         IOCON_PIO_SLEW_STANDARD |
                                         /* Input function is not inverted */
                                         IOCON_PIO_INV_DI |
                                         /* Enables analog function */
                                         IOCON_PIO_ANALOG_EN |
                                         /* Open drain is disabled */
                                         IOCON_PIO_OPENDRAIN_DI);
    /* PORT028 (pin 66) is disabled */
    IOCON_PinMuxSet(IOCON, 0U, 28U, port0_pin28_config);

    const uint32_t DEBUG_UART_RX = (/* Pin is disabled */
                                    IOCON_PIO_FUNC0 |
                                    /* No addition pin function */
                                    IOCON_PIO_MODE_INACT |
                                    /* Standard mode, output slew rate control is enabled */
                                    IOCON_PIO_SLEW_STANDARD |
                                    /* Input function is not inverted */
                                    IOCON_PIO_INV_DI |
                                    /* Enables analog function */
                                    IOCON_PIO_ANALOG_EN |
                                    /* Open drain is disabled */
                                    IOCON_PIO_OPENDRAIN_DI);
    /* PORT029 (pin 92) is disabled */
    IOCON_PinMuxSet(IOCON, SETDEFAULTROUTING_DEBUG_UART_RX_PORT, SETDEFAULTROUTING_DEBUG_UART_RX_PIN, DEBUG_UART_RX);

    const uint32_t port0_pin3_config = (/* Pin is disabled */
                                        IOCON_PIO_FUNC0 |
                                        /* No addition pin function */
                                        IOCON_PIO_MODE_INACT |
                                        /* Standard mode, output slew rate control is enabled */
                                        IOCON_PIO_SLEW_STANDARD |
                                        /* Input function is not inverted */
                                        IOCON_PIO_INV_DI |
                                        /* Enables analog function */
                                        IOCON_PIO_ANALOG_EN |
                                        /* Open drain is disabled */
                                        IOCON_PIO_OPENDRAIN_DI);
    /* PORT03 (pin 83) is disabled */
    IOCON_PinMuxSet(IOCON, 0U, 3U, port0_pin3_config);

    const uint32_t DEBUG_UART_TX = (/* Pin is disabled */
                                    IOCON_PIO_FUNC0 |
                                    /* No addition pin function */
                                    IOCON_PIO_MODE_INACT |
                                    /* Standard mode, output slew rate control is enabled */
                                    IOCON_PIO_SLEW_STANDARD |
                                    /* Input function is not inverted */
                                    IOCON_PIO_INV_DI |
                                    /* Enables analog function */
                                    IOCON_PIO_ANALOG_EN |
                                    /* Open drain is disabled */
                                    IOCON_PIO_OPENDRAIN_DI);
    /* PORT030 (pin 94) is disabled */
    IOCON_PinMuxSet(IOCON, SETDEFAULTROUTING_DEBUG_UART_TX_PORT, SETDEFAULTROUTING_DEBUG_UART_TX_PIN, DEBUG_UART_TX);

    if (Chip_GetVersion()==1)
    {
        const uint32_t port0_pin31_config = (/* Pin is disabled */
                                             IOCON_PIO_FUNC0 |
                                             /* No addition pin function */
                                             IOCON_PIO_MODE_INACT |
                                             /* Standard mode, output slew rate control is enabled */
                                             IOCON_PIO_SLEW_STANDARD |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables analog function */
                                             IOCON_PIO_ANALOG_EN |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI |
                                             /* Analog switch is open (disabled) */
                                             IOCON_PIO_ASW_DI);
        /* PORT031 (pin 23) is disabled */
        IOCON_PinMuxSet(IOCON, 0U, 31U, port0_pin31_config);
    }
    else
    {
        const uint32_t port0_pin31_config = (/* Pin is disabled */
                                             IOCON_PIO_FUNC0 |
                                             /* No addition pin function */
                                             IOCON_PIO_MODE_INACT |
                                             /* Standard mode, output slew rate control is enabled */
                                             IOCON_PIO_SLEW_STANDARD |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables analog function */
                                             IOCON_PIO_ANALOG_EN |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI |
                                             /* Analog switch is open (disabled), only for A0 version */
                                             IOCON_PIO_ASW_DIS_DI);
        /* PORT031 (pin 23) is disabled */
        IOCON_PinMuxSet(IOCON, 0U, 31U, port0_pin31_config);
    }

