lbekit/MicroprocessorProjects/board/pin_mux.c
    const uint32_t port0_pin4_config = (/* Pin is disabled */
                                        IOCON_PIO_FUNC0 |
                                        /* No addition pin function */
                                        IOCON_PIO_MODE_INACT |
                                        /* Standard mode, output slew rate control is enabled */
                                        IOCON_PIO_SLEW_STANDARD |
                                        /* Input function is not inverted */
                                        IOCON_PIO_INV_DI |
                                        /* Enables analog function */
                                        IOCON_PIO_ANALOG_EN |
                                        /* Open drain is disabled */
                                        IOCON_PIO_OPENDRAIN_DI);
    /* PORT04 (pin 86) is disabled */
    IOCON_PinMuxSet(IOCON, 0U, 4U, port0_pin4_config);

    const uint32_t port0_pin6_config = (/* Pin is disabled */
                                        IOCON_PIO_FUNC0 |
                                        /* No addition pin function */
                                        IOCON_PIO_MODE_INACT |
                                        /* Standard mode, output slew rate control is enabled */
                                        IOCON_PIO_SLEW_STANDARD |
                                        /* Input function is not inverted */
                                        IOCON_PIO_INV_DI |
                                        /* Enables analog function */
                                        IOCON_PIO_ANALOG_EN |
                                        /* Open drain is disabled */
                                        IOCON_PIO_OPENDRAIN_DI);
    /* PORT06 (pin 89) is disabled */
    IOCON_PinMuxSet(IOCON, 0U, 6U, port0_pin6_config);

    const uint32_t port0_pin7_config = (/* Pin is disabled */
                                        IOCON_PIO_FUNC0 |
                                        /* No addition pin function */
                                        IOCON_PIO_MODE_INACT |
                                        /* Standard mode, output slew rate control is enabled */
                                        IOCON_PIO_SLEW_STANDARD |
                                        /* Input function is not inverted */
                                        IOCON_PIO_INV_DI |
                                        /* Enables analog function */
                                        IOCON_PIO_ANALOG_EN |
                                        /* Open drain is disabled */
                                        IOCON_PIO_OPENDRAIN_DI);
    /* PORT07 (pin 6) is disabled */
    IOCON_PinMuxSet(IOCON, 0U, 7U, port0_pin7_config);

    const uint32_t port0_pin8_config = (/* Pin is disabled */
                                        IOCON_PIO_FUNC0 |
                                        /* No addition pin function */
                                        IOCON_PIO_MODE_INACT |
                                        /* Standard mode, output slew rate control is enabled */
                                        IOCON_PIO_SLEW_STANDARD |
                                        /* Input function is not inverted */
                                        IOCON_PIO_INV_DI |
                                        /* Enables analog function */
                                        IOCON_PIO_ANALOG_EN |
                                        /* Open drain is disabled */
                                        IOCON_PIO_OPENDRAIN_DI);
    /* PORT08 (pin 26) is disabled */
    IOCON_PinMuxSet(IOCON, 0U, 8U, port0_pin8_config);

    if (Chip_GetVersion()==1)
    {
        const uint32_t port0_pin9_config = (/* Pin is disabled */
                                            IOCON_PIO_FUNC0 |
                                            /* No addition pin function */
                                            IOCON_PIO_MODE_INACT |
                                            /* Standard mode, output slew rate control is enabled */
                                            IOCON_PIO_SLEW_STANDARD |
                                            /* Input function is not inverted */
                                            IOCON_PIO_INV_DI |
                                            /* Enables analog function */
                                            IOCON_PIO_ANALOG_EN |
                                            /* Open drain is disabled */
                                            IOCON_PIO_OPENDRAIN_DI |
                                            /* Analog switch is open (disabled) */
                                            IOCON_PIO_ASW_DI);
        /* PORT09 (pin 55) is disabled */
        IOCON_PinMuxSet(IOCON, 0U, 9U, port0_pin9_config);
    }
    else
    {
        const uint32_t port0_pin9_config = (/* Pin is disabled */
                                            IOCON_PIO_FUNC0 |
                                            /* No addition pin function */
                                            IOCON_PIO_MODE_INACT |
                                            /* Standard mode, output slew rate control is enabled */
                                            IOCON_PIO_SLEW_STANDARD |
                                            /* Input function is not inverted */
                                            IOCON_PIO_INV_DI |
                                            /* Enables analog function */
                                            IOCON_PIO_ANALOG_EN |
                                            /* Open drain is disabled */
                                            IOCON_PIO_OPENDRAIN_DI |
                                            /* Analog switch is open (disabled), only for A0 version */
                                            IOCON_PIO_ASW_DIS_DI);
        /* PORT09 (pin 55) is disabled */
        IOCON_PinMuxSet(IOCON, 0U, 9U, port0_pin9_config);
    }

    if (Chip_GetVersion()==1)
    {
        const uint32_t port1_pin0_config = (/* Pin is disabled */
                                            IOCON_PIO_FUNC0 |
                                            /* No addition pin function */
                                            IOCON_PIO_MODE_INACT |
                                            /* Standard mode, output slew rate control is enabled */
                                            IOCON_PIO_SLEW_STANDARD |
                                            /* Input function is not inverted */
                                            IOCON_PIO_INV_DI |
                                            /* Enables analog function */
                                            IOCON_PIO_ANALOG_EN |
                                            /* Open drain is disabled */
                                            IOCON_PIO_OPENDRAIN_DI |
                                            /* Analog switch is open (disabled) */
                                            IOCON_PIO_ASW_DI);
        /* PORT10 (pin 11) is disabled */
        IOCON_PinMuxSet(IOCON, 1U, 0U, port1_pin0_config);
    }
    else
    {
        const uint32_t port1_pin0_config = (/* Pin is disabled */
                                            IOCON_PIO_FUNC0 |
                                            /* No addition pin function */
                                            IOCON_PIO_MODE_INACT |
                                            /* Standard mode, output slew rate control is enabled */
                                            IOCON_PIO_SLEW_STANDARD |
                                            /* Input function is not inverted */
                                            IOCON_PIO_INV_DI |
                                            /* Enables analog function */
                                            IOCON_PIO_ANALOG_EN |
                                            /* Open drain is disabled */
                                            IOCON_PIO_OPENDRAIN_DI |
                                            /* Analog switch is open (disabled), only for A0 version */
                                            IOCON_PIO_ASW_DIS_DI);
        /* PORT10 (pin 11) is disabled */
        IOCON_PinMuxSet(IOCON, 1U, 0U, port1_pin0_config);
    }

    const uint32_t port1_pin1_config = (/* Pin is disabled */
                                        IOCON_PIO_FUNC0 |
                                        /* No addition pin function */
                                        IOCON_PIO_MODE_INACT |
                                        /* Standard mode, output slew rate control is enabled */
                                        IOCON_PIO_SLEW_STANDARD |
                                        /* Input function is not inverted */
                                        IOCON_PIO_INV_DI |
                                        /* Enables analog function */
                                        IOCON_PIO_ANALOG_EN |
                                        /* Open drain is disabled */
                                        IOCON_PIO_OPENDRAIN_DI);
    /* PORT11 (pin 59) is disabled */
    IOCON_PinMuxSet(IOCON, 1U, 1U, port1_pin1_config);

    const uint32_t port1_pin10_config = (/* Pin is disabled */
                                         IOCON_PIO_FUNC0 |
                                         /* No addition pin function */
                                         IOCON_PIO_MODE_INACT |
                                         /* Standard mode, output slew rate control is enabled */
                                         IOCON_PIO_SLEW_STANDARD |
                                         /* Input function is not inverted */
                                         IOCON_PIO_INV_DI |
                                         /* Enables analog function */
                                         IOCON_PIO_ANALOG_EN |
                                         /* Open drain is disabled */
                                         IOCON_PIO_OPENDRAIN_DI);
    /* PORT110 (pin 40) is disabled */
    IOCON_PinMuxSet(IOCON, 1U, 10U, port1_pin10_config);

    const uint32_t port1_pin11_config = (/* Pin is disabled */
                                         IOCON_PIO_FUNC0 |
                                         /* No addition pin function */
                                         IOCON_PIO_MODE_INACT |
                                         /* Standard mode, output slew rate control is enabled */
                                         IOCON_PIO_SLEW_STANDARD |
                                         /* Input function is not inverted */
                                         IOCON_PIO_INV_DI |
                                         /* Enables analog function */
                                         IOCON_PIO_ANALOG_EN |
                                         /* Open drain is disabled */
                                         IOCON_PIO_OPENDRAIN_DI);
    /* PORT111 (pin 93) is disabled */
    IOCON_PinMuxSet(IOCON, 1U, 11U, port1_pin11_config);

