lbekit/MicroprocessorProjects/board/pin_mux.c
    const uint32_t LED_BLUE = (/* Pin is disabled */
                               IOCON_PIO_FUNC0 |
                               /* No addition pin function */
                               IOCON_PIO_MODE_INACT |
                               /* Standard mode, output slew rate control is enabled */
                               IOCON_PIO_SLEW_STANDARD |
                               /* Input function is not inverted */
                               IOCON_PIO_INV_DI |
                               /* Enables analog function */
                               IOCON_PIO_ANALOG_EN |
                               /* Open drain is disabled */
                               IOCON_PIO_OPENDRAIN_DI);
    /* PORT14 (pin 1) is disabled */
    IOCON_PinMuxSet(IOCON, SETDEFAULTROUTING_LED_BLUE_PORT, SETDEFAULTROUTING_LED_BLUE_PIN, LED_BLUE);

    const uint32_t port1_pin5_config = (/* Pin is disabled */
                                        IOCON_PIO_FUNC0 |
                                        /* No addition pin function */
                                        IOCON_PIO_MODE_INACT |
                                        /* Standard mode, output slew rate control is enabled */
                                        IOCON_PIO_SLEW_STANDARD |
                                        /* Input function is not inverted */
                                        IOCON_PIO_INV_DI |
                                        /* Enables analog function */
                                        IOCON_PIO_ANALOG_EN |
                                        /* Open drain is disabled */
                                        IOCON_PIO_OPENDRAIN_DI);
    /* PORT15 (pin 31) is disabled */
    IOCON_PinMuxSet(IOCON, 1U, 5U, port1_pin5_config);

    const uint32_t LED_RED = (/* Pin is disabled */
                              IOCON_PIO_FUNC0 |
                              /* No addition pin function */
                              IOCON_PIO_MODE_INACT |
                              /* Standard mode, output slew rate control is enabled */
                              IOCON_PIO_SLEW_STANDARD |
                              /* Input function is not inverted */
                              IOCON_PIO_INV_DI |
                              /* Enables analog function */
                              IOCON_PIO_ANALOG_EN |
                              /* Open drain is disabled */
                              IOCON_PIO_OPENDRAIN_DI);
    /* PORT16 (pin 5) is disabled */
    IOCON_PinMuxSet(IOCON, SETDEFAULTROUTING_LED_RED_PORT, SETDEFAULTROUTING_LED_RED_PIN, LED_RED);

    const uint32_t LED_GREEN = (/* Pin is disabled */
                                IOCON_PIO_FUNC0 |
                                /* No addition pin function */
                                IOCON_PIO_MODE_INACT |
                                /* Standard mode, output slew rate control is enabled */
                                IOCON_PIO_SLEW_STANDARD |
                                /* Input function is not inverted */
                                IOCON_PIO_INV_DI |
                                /* Enables analog function */
                                IOCON_PIO_ANALOG_EN |
                                /* Open drain is disabled */
                                IOCON_PIO_OPENDRAIN_DI);
    /* PORT17 (pin 9) is disabled */
    IOCON_PinMuxSet(IOCON, SETDEFAULTROUTING_LED_GREEN_PORT, SETDEFAULTROUTING_LED_GREEN_PIN, LED_GREEN);

    const uint32_t port1_pin8_config = (/* Pin is disabled */
                                        IOCON_PIO_FUNC0 |
                                        /* No addition pin function */
                                        IOCON_PIO_MODE_INACT |
                                        /* Standard mode, output slew rate control is enabled */
                                        IOCON_PIO_SLEW_STANDARD |
                                        /* Input function is not inverted */
                                        IOCON_PIO_INV_DI |
                                        /* Enables analog function */
                                        IOCON_PIO_ANALOG_EN |
                                        /* Open drain is disabled */
                                        IOCON_PIO_OPENDRAIN_DI |
                                        /* Analog switch is open (disabled) */
                                        IOCON_PIO_ASW_DI);
    /* PORT18 (pin 24) is disabled */
    IOCON_PinMuxSet(IOCON, 1U, 8U, port1_pin8_config);

    if (Chip_GetVersion()==1)
    {
        const uint32_t S3 = (/* Pin is disabled */
                             IOCON_PIO_FUNC0 |
                             /* No addition pin function */
                             IOCON_PIO_MODE_INACT |
                             /* Standard mode, output slew rate control is enabled */
                             IOCON_PIO_SLEW_STANDARD |
                             /* Input function is not inverted */
                             IOCON_PIO_INV_DI |
                             /* Enables analog function */
                             IOCON_PIO_ANALOG_EN |
                             /* Open drain is disabled */
                             IOCON_PIO_OPENDRAIN_DI |
                             /* Analog switch is open (disabled) */
                             IOCON_PIO_ASW_DI);
        /* PORT19 (pin 10) is disabled */
        IOCON_PinMuxSet(IOCON, SETDEFAULTROUTING_S3_PORT, SETDEFAULTROUTING_S3_PIN, S3);
    }
    else
    {
        const uint32_t S3 = (/* Pin is disabled */
                             IOCON_PIO_FUNC0 |
                             /* No addition pin function */
                             IOCON_PIO_MODE_INACT |
                             /* Standard mode, output slew rate control is enabled */
                             IOCON_PIO_SLEW_STANDARD |
                             /* Input function is not inverted */
                             IOCON_PIO_INV_DI |
                             /* Enables analog function */
                             IOCON_PIO_ANALOG_EN |
                             /* Open drain is disabled */
                             IOCON_PIO_OPENDRAIN_DI |
                             /* Analog switch is open (disabled), only for A0 version */
                             IOCON_PIO_ASW_DIS_DI);
        /* PORT19 (pin 10) is disabled */
        IOCON_PinMuxSet(IOCON, SETDEFAULTROUTING_S3_PORT, SETDEFAULTROUTING_S3_PIN, S3);
    }
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
Board_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '10', peripheral: PINT, signal: 'PINT, 0', pin_signal: PIO1_9/FC1_SCK/CT_INP4/SCT0_OUT2/FC4_CTS_SDA_SSEL0/ADC0_12}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

